Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of Pūrṇa

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time:

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་འོད་མའི་ཚལ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་མང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་ཚད་མེད་པ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing at the Veṇuvana in Rājagṛha, together with a great saṅgha of many monks and with countless bodhisattva great beings.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that time, the venerable Pūrṇa Maitrāyaṇīputra arose, draped his shawl over one shoulder, and knelt on his right knee. With his palms joined together in the direction of the Blessed One he said, “Blessed One, I have a few questions to ask you.

source: །བཅོམ་ལྡན་འདས་བདག་ལ་ཞུ་བ་ཅུང་ཟད་ཅིག་མཆིས་ན་དེ་བཞིན་གཤེགས་པས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་རྗེས་སུ་གནང་བར་མཛད་དུ་གསོལ།
en: Thus-Gone One, please consider me with love and grant me this request.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་མའི་བུ་གང་པོ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། ངས་ཡང་དག་པར་བསྟན་ནས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: “Pūrṇa Maitrāyaṇīputra,” replied the Blessed One, “ask me whatever you wish. I will instruct you genuinely and satisfy your mind.”

source: །ཚེ་དང་ལྡན་པ་གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེང་བདག་ནི་ཡོན་ཏན་མཆོག་མངོན་པར་བསྒྲུབས་པ། གྲགས་པ་ཤིན་དུ་མཐོ་ཞིང་རྒྱང་རིང་བ། རྟག་པར་སེམས་ཅན་གྱི་བདེ་བ་ཡོངས་སུ་གཉེར་བར་བགྱིད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སླད་དུ་ཞུ་བ་མཆིས་ལགས་སོ།
en: “Blessed One,” said the venerable Pūrṇa, “I have questions about the bodhisattva great beings who have accomplished the highest qualities and attained superior and far-reaching renown, and who pursue the happiness of sentient beings at all times.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: And the venerable Pūrṇa Maitrāyaṇīputra then put his questions in these verses: “I have questions about those

source: ཡོན་ཏན་མཆོག་ནི་རབ་བསྒྲུབས་ནས།
en: Who have accomplished the highest qualities,

source: །གྲགས་པ་མཐོ་ཞིང་རྒྱང་རིང་དང་། །ཚུལ་ཁྲིམས་གཙང་ཞིང་ཆོས་མོས་པའི། །སྤྱོད་པ་གང་ལགས་བདག་ཞུ་ལགས།
en: Who have attained superior and far-reaching renown, And who observe pure discipline and conduct devoted to the Dharma.

source: །ཇི་ལྟར་སེམས་ནི་སྦྱོང་བར་བགྱིད།
en: “How do they train their minds?

source: །ཇི་ལྟར་སྦྱིན་པ་རྒྱ་ཆེར་གཏང་།
en: How do they practice generosity on a vast scale?

source: །ཇི་ལྟར་སེམས་ཅན་རབ་སྒྲོལ་ཅིང་།
en: How do they liberate sentient beings?

source: །དགའ་སེམས་རྟག་ཏུ་ལམ་སྒོམ་ལགས།
en: How do they constantly cultivate the path with a joyful mind?

source: །ཡང་བཅོམ་ལྡན་འདས་ལ་བྱམས་མའི་བུ་གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེང་བདག་ནི་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་སླད་དུ་དངོས་པོ་དེ་ལྟ་བུ་དག་ཞུ་བ་ལགས་ན་བྱང་ཆུབ་སེམས་དཔས།
en: “Blessed One,” continued Pūrṇa Maitrāyaṇīputra, “I have questions about these holy beings.

source: ཇི་ལྟར་མང་དུ་ཐོས་པ་རྒྱ་མཚོ་ཆེན་པོ་ལྟ་བུར་བསགས་པས་ཡོངས་སུ་གཏུགས་པར་མི་འགྱུར་ལགས།
en: How do bodhisattvas amass great knowledge, such that it will not be exhausted, like the ocean?

source: ཇི་ལྟར་མང་དུ་ཐོས་པའི་གཏེར་རིན་པོ་ཆེ་བསགས་ནས་ཆོས་རྣམས་ལ་ངེས་པའི་དོན་ཐོབ་པས་ཚིག་གི་དོན་རྣམས་ལེགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར་ལགས།
en: Having amassed a precious treasure of erudition, how is it that, by comprehending the meaning that is definitive with regard to all phenomena, they correctly penetrate the meaning of words?”

source: དེ་ནས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: He then spoke again in verse:

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས།
en: “How do bodhisattvas seek

source: །མང་ཐོས་རྒྱ་མཚོ་ལྟ་བུ་ཚོལ།
en: A level of erudition like a vast ocean,

source: །ཆོས་ལ་ངེས་པའི་དོན་ཐོབ་ནས།
en: And having comprehended the meaning that is definitive with regard to phenomena,

source: །བྱང་ཆུབ་ལམ་ནི་ལེགས་རྟོགས་འགྱུར།
en: How do they gain an understanding of the path to awakening?

source: །ཇི་ལྟ་བུར་ན་ཚིག་གཅིག་གིས། །ཚད་མེད་དོན་ནི་རབ་རྟོགས་ཏེ།
en: “How do they understand boundless meanings Through a single word,

source: །འདི་ལྟར་ཤེས་རབ་སྟོབས་དག་གིས།
en: So that, through the power of such insight,

source: །ཆོས་རྣམས་ཐམས་ཅད་རྟོགས་འགྱུར་ལགས།
en: They can comprehend all phenomena?

source: །མང་ཐོས་མཐར་ཐུག་མ་མཆིས་པས།
en: “Since their erudition is infinite,

source: །རྒོལ་བ་མཆིས་ཀྱང་སེམས་མི་གཡོ།
en: Their minds do not waver, even when faced with opponents.

source: །སྙིང་བརྩེ་སླད་དུ་ཆོས་བསྟན་ནས།
en: Teaching the Dharma out of compassion,

source: །སེམས་ཅན་ཐེ་ཚོམ་གཅོད་བགྱིད་ལགས།
en: They eliminate the doubts of sentient beings.

source: །བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཡང་གསོལ་པ། བཅོམ་ལྡན་འདས་དེང་བདག་ནི་སའི་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བ་གསོལ་བ་ལགས་ན།
en: “Blessed One,” continued the venerable Pūrṇa Maitrāyaṇīputra, “I have another question for the Thus-Gone One about the force of the wisdom that follows from the attainment of the bodhisattva levels.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཡོངས་སུ་ལྡོག་པར་མི་འགྱུར་ལགས།
en: How is it that bodhisattva great beings’ progress toward unsurpassed and perfect awakening will be irreversible?”

source: དེ་ནས་ཡང་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: He then went on in verse:

source: ཇི་ལྟར་མི་ཁོམ་ཡོངས་སྤངས་ནས།
en: “Having abandoned the states without freedom,

source: །སངས་རྒྱས་མང་པོ་ཕྲད་གྱུར་ལགས།
en: How do they encounter many buddhas?

source: །སངས་རྒྱས་མང་པོ་མཐོང་ནས་ཀྱང་།
en: And having seen many buddhas,

source: །ཤིན་དུ་དང་བ་མྱུར་འཐོབ་ལགས།
en: How do they swiftly develop sincere faith?

source: །བླ་མེད་དང་བ་ཐོབ་གྱུར་ནས།
en: “Having developed that unsurpassed type of faith,

source: །ཤིན་དུ་གཏང་དཀའ་གཏོང་བར་འགྱུར།
en: How do they give away that which is extremely difficult to give away?

source: །ཐམས་ཅད་ཡོངས་སུ་བཏང་ནས་ཀྱང་།
en: Having completely given everything away,

source: །སྟོབས་ཀྱིས་ཐོགས་མེད་ལམ་སྤྱོད་ལགས།
en: How with that force do they practice unhindered on the path?

source: །ཇི་ལྟར་རབ་འབྱུང་མོས་གྱུར་ནས།
en: “Having developed the aspiration to go forth,

source: །དབེན་གནས་སྟོང་པའི་ཡེ་ཤེས་སྒོམ།
en: How do they cultivate the wisdom of emptiness in isolated places?

source: །ཇི་ལྟར་ཆོས་དང་འགལ་མི་བགྱིད།
en: How do they act in ways that do not contradict the Dharma?

source: །དངོས་པོ་འདི་ནི་བཀས་བཤད་གསོལ།
en: Please elucidate these matters.

source: །བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཡང་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་མཁྱེན་པ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་དང་། རྫུ་འཕྲུལ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་བྱོན་པ་དང་། ཁམས་གསུམ་ན་མཆོག་ཏུ་གྱུར་པས་དཔེ་ཟླ་མ་མཆིས་པའི་ཡེ་ཤེས་ཆེན་པོ་གྱ་ནོམ་པ་བརྙེས་ནས་ཆོས་རྣམས་ལ་སྤྱོད་པ་ཐོགས་པ་མི་མངའ་བར་ཁོང་དུ་ཆུད་པས་ན་དེའི་སླད་དུ་དེང་བདག་དངོས་པོ་འདི་དག་ཞུ་བ་ལགས་སོ།
en: “Blessed One,” continued the venerable Pūrṇa Maitrāyaṇīputra, “the thus-gone ones have reached perfect omniscience. They have mastered all miraculous powers and are the supreme beings within the three realms. Having achieved incomparable, sublime wisdom, they know how to put the Dharma into action in an unhindered manner. These are the reasons why I ask you these questions.”

source: །དེ་ནས་ཡང་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: He again spoke in verse:

source: བཅོམ་ལྡན་ཡོན་ཏན་མཆོག་བཞུགས་པས།
en: “Blessed One, since you possess the most sublime qualities,

source: །རྫུ་འཕྲུལ་ཕ་རོལ་རབ་ཏུ་བྱོན།
en: Since you master the miraculous displays,

source: །ཐོགས་པ་མི་མངའི་མཁྱེན་བརྙེས་པས།
en: And since you have reached unimpeded wisdom,

source: །དཔའ་བོ་ཁྱོད་ལ་བདག་ཞུ་ལགས།
en: I ask these questions of you, great hero.

source: །ཆོས་རྣམས་ཐམས་ཅད་ལེགས་བསླབས་པས།
en: “Since you are perfectly trained in all Dharma teachings,

source: །ཡོན་ཏན་མཐོ་ཞིང་མངོན་པར་འཕགས།
en: Since your qualities are superior and outstanding,

source: མུན་བཅོམ་ཤེས་རབ་སྣང་བསྐྱེད་པས།
en: And since you radiate the light of wisdom that dispels darkness,

source: །འཁོར་མང་ཐམས་ཅད་དགའ་བར་མཛད།
en: You bring delight to the multitudes who attend you.

source: །དགྲ་ཟིན་བྱམས་སྡང་མི་མངའ་ཞིང་།
en: “You are free from attachment and aversion to friends and enemies;

source: །མྱ་ངན་མི་མངའ་སྐུ་མི་མངའ།
en: You are free from sorrow and deception.

source: །འཆི་བདག་ལས་ནི་རབ་རྒྱལ་ཞིང་།
en: You have conquered the Lord of Death,

source: །བདུད་དཔུང་དག་ནི་ཕམ་པར་མཛད།
en: And defeated the armies of Māra.

source: །མཚོན་ཆ་ཐོགས་པ་མི་མངའ་བར།
en: “Without brandishing any weapon,

source: །དགྲ་རྣམས་ཐམས་ཅད་ཕམ་པར་མཛད།
en: You have defeated all your enemies.

source: །རྟག་པར་བྱམས་པའི་ཐུགས་ལྡན་ཞིང་།
en: With a mind always filled with love,

source: །ཚུལ་ཁྲིམས་རྣམ་དག་བརྟན་པར་གནས།
en: You firmly maintain pure discipline.

source: །བཅོམ་ལྡན་གཡོ་སྒྱུ་མི་མངའ་ཞིང་།
en: “Blessed One, you are free of deceit and guile,

source: །ང་རྒྱལ་མི་མངའ་དྲེགས་མི་མངའ།
en: Free of pride, and free of arrogance.

source: །རྣམ་གྲོལ་རིག་པ་བརྙེས་པས་ན།
en: Since you have attained the knowledge of liberation,

source: །ཡོན་ཏན་ཀུན་གྱི་མཆོག་ཏུ་གྱུར།
en: You possess the highest of all qualities.

source: །ཇི་ལྟར་སྔོན་ནི་ལམ་སྤྱད་ནས།
en: “How did you, in the past, reach supreme knowledge

source: །མཁྱེན་པ་མཆོག་ནི་བརྙེས་པ་དང་།
en: By means of practicing on the path?

source: །ཇི་ལྟར་སྤྱད་ནས་སངས་རྒྱས་པ།
en: How did you awaken through practice?

source: །བདག་ལ་དེང་ནི་བཀས་བཤད་གསོལ།
en: Please explain this to me!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་དངོས་པོ་དེ་ལྟ་བུ་དག་ཞུས་པ་དེ་ལེགས་སོ་ལེགས་སོ།
en: In response, the Blessed One said to the venerable Pūrṇa Maitrāyaṇīputra, “These questions you ask of the Thus-Gone One are excellent, excellent!

source: །ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་ནས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་ཡང་དག་པར་བསྟན་པར་བྱའོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Listen carefully and pay attention. I will now teach you how bodhisattvas give rise to their intention and then accomplish the immeasurable qualities of a buddha.” The Blessed One then uttered these verses:

source: ངས་དེང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །དང་པོ་བྱང་ཆུབ་སེམས་བསྐྱེད་ནས། །རབ་ཏུ་བརྩོན་པའི་སྟོབས་དག་གིས། །བྱང་ཆུབ་ལམ་སྤྱད་བཤད་པར་བྱ།
en: “I will explain to you now How bodhisattvas first give rise to the mind set on awakening, And then practice on the path to awakening, Through the power of their intensive diligence.

source: །བྱང་ཆུབ་སེམས་དཔས་སྤྱད་པ་ཡི། །ལྷག་པའི་བསམ་པ་སྣ་ཚོགས་ཀྱིས།
en: “There are many kinds of good intentions That bodhisattvas apply in their activity;

source: །སངས་རྒྱས་ལུང་ནི་བསྟན་གྱུར་པ།
en: And those factors, which the buddhas have explained

source: །དངོས་པོ་དེ་དག་མདོར་བསྟན་ཏོ།
en: In detail, I will briefly teach you.

source: །ལྷག་པའི་བསམ་པས་ཆོས་མོས་སེམས།
en: “The devotion to the Dharma to which they give rise

source: །ཚད་མེད་མཐའ་ཡང་ཡོད་མ་ཡིན།
en: Through these extraordinary attitudes is immeasurable—it is infinite.

source: །སྤྱོད་པ་སྣ་ཚོགས་སྟོན་བྱེད་པ།
en: That they display their many kinds of activities

source: །དངོས་པ་གཅིག་གིས་འགྲུབ་མི་འགྱུར།
en: Is not brought about through one thing alone.

source: །དགའ་སེམས་ནང་ནི་རབ་རྒྱས་པས།
en: “It is joy blossoming in their minds

source: །སྦྱིན་པ་དག་ནི་གཏོང་བར་བྱེད།
en: That makes bodhisattvas perform acts of generosity,

source: །སྦྱིན་པ་གཏོང་ཡང་འགྱོད་མེད་པས།
en: And since they practice generosity without having regrets,

source: །དེ་ཡི་སེམས་ནི་དགའ་བར་འགྱུར།
en: Their minds become more joyful.

source: །བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ།
en: “Bodhisattvas think,

source: །སེམས་ཅན་རྟག་ཏུ་རྒུད་པས་ན།
en: ‘Since sentient beings are always impoverished,

source: །མང་དུ་ཐོས་པའི་ནོར་མི་ལྡན།
en: They do not possess the wealth of erudition.

source: །བདག་གིས་བཙལ་བྱ་སྙམ་དུ་སེམས།
en: So I must pursue such wealth!

source: །སེམས་ཅན་རྟག་ཏུ་རྒུད་པ་ཡང་།
en: “ ‘Sentient beings, though always impoverished,

source: །ལེ་ལོའི་དབང་ལས་གྱུར་པས་ན།
en: Fall under the influence of laziness.

source: །བདག་གིས་བརྩོན་འགྲུས་རབ་བསྐྱེད་དེ།
en: I must therefore develop my diligence

source: །བྱང་ཆུབ་ཐོབ་བྱ་སྙམ་དུ་སེམས།
en: And reach the state of awakening!

source: །བདག་གིས་སེམས་ཅན་ཆེད་དུ་ནི།
en: “ ‘With the thought that it is for the sake of sentient beings,

source: །ཡིད་བཞིན་བཟོད་པ་རབ་བསྐྱེད་དེ།
en: I shall cultivate patience.

source: །ཚིག་ངན་སྨ་འབེབས་བརྡེགས་གྱུར་ཀྱང་།
en: Even if I am insulted or beaten,

source: །ལན་ཡང་མི་སྨྲ་སྙམ་དུ་སེམས།
en: I will not say anything in return.

source: །བདག་ལ་སྨྲ་འབེབས་སུ་ཞིག་ཡིན།
en: “ ‘Who is abusing me?

source: །སྨ་འབེབས་དམིགས་པར་མི་འགྱུར་བས། །སྨྲ་འབེབས་ཁོང་ཁྲོ་བྱེད་པ་ཡི། །དངོས་པོ་ཐམས་ཅད་སྟོང་སྙམ་སེམས།
en: Since an abuser cannot be perceived, All those abusers And those who are angry are empty!’

source: །དེ་ལྟར་ཡིད་ལ་སེམས་པས་ན།
en: “It is because they think in that way

source: །སེམས་ལ་ཁོང་ཁྲོ་འཁོན་འཛིན་མེད།
en: That their minds are devoid of aggression and resentment.

source: །རྟག་ཏུ་བཟོད་པ་བསྒོམས་པས་ན། །དེས་ན་མངོན་པར་འཚང་ཡང་རྒྱ།
en: Since they always cultivate patience, They will become perfect buddhas.

source: །སེམས་ཅན་དགེ་སེམས་མེད་པ་ལ། །འཇིག་རྟེན་སྒྲོན་མ་བྱས་ནས་ནི། །མགོན་དང་སྐྱབས་ནི་བྱེད་པས་ན།
en: “Acting as lamps within the world, They provide protection and refuge To sentient beings whose minds are not inclined toward virtue,

source: །ནོར་མེད་ནོར་དང་ལྡན་པར་བྱེད།
en: And they cause the impoverished to become wealthy.

source: །སེམས་ཅན་ལམ་ལོག་སྤྱོད་པ་ནི།
en: “They think, ‘Since sentient beings who follow mistaken paths

source: །དེ་དག་སྙིང་བརྩེའི་གནས་ཡིན་པས།
en: Are the objects of my compassion,

source: །བདག་གིས་ཡོངས་སུ་བཟླས་ནས་ནི།
en: I shall liberate them

source: །མྱ་ངན་འདས་ལ་གཞག་སྙམ་སེམས།
en: And establish them in nirvāṇa!’

source: །སེམས་ཅན་ཐམས་ཅད་རྒུད་པས་ན།
en: “They think, ‘Since all sentient beings are impoverished,

source: །ཤེས་རབ་ནོར་དང་ཡང་མི་ལྡན།
en: They do not possess the wealth of insight.

source: །བདག་གིས་ཐམས་ཅད་མཁྱེན་ཐོབ་ནས།
en: After reaching the state of omniscience,

source: །དེ་དག་ཚིམ་པར་བྱ་སྙམ་སེམས།
en: I shall bring them satiation.’

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །སེམས་ཅན་ཡོངས་སུ་བཟླ་བའི་ཕྱིར། །སེམས་བསྐྱེད་བྱང་ཆུབ་ཚོལ་བ་ན། །དེ་འདྲའི་སྨོན་ལམ་འདེབས་པར་བྱེད།
en: “It is in such ways that bodhisattvas, In order to liberate sentient beings, Keep persevering on the path As they engender the mind set on awakening and strive for it.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་རྒྱུ་རྐྱེན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་ལ་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་འགའ་ཙམ་ལ་ཡང་གནས་པར་མི་བྱེད་དོ།
en: The Blessed One then said to the venerable Pūrṇa Maitrāyaṇīputra, “Through these different causes and conditions, bodhisattva great beings teach the Dharma to sentient beings; yet they do not dwell on just some Dharma teachings.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་བསླབས་ནས་དེའི་འོག་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བས་སོ།
en: Because it is after having correctly trained in all Dharma teachings that bodhisattvas will later become perfect buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་རྣམ་པ་བཞི་དང་ལྡན་པས་ཆོས་གཞན་གང་ཡང་དངོས་པོ་འདི་ལས་ལྷག་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: “Bodhisattvas have four amazing and marvelous attitudes, compared to which they see no other Dharma teaching as more important.

source: །བཞི་གང་ཞེ་ན།
en: What are the four?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ལེ་ལོ་ཅན་རྣམས་ལ་བརྩོན་འགྲུས་རྩོམ་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་དང་པོ་ཞེས་བྱའོ།
en: (1) That which makes bodhisattvas cultivate diligence with regard to lazy beings; this is the first amazing and marvelous attitude.

source: །ཁོང་ཁྲོའི་སེམས་ཅན་ནན་པོ་ཆེ་དག་གི་ནང་ན་བཟོད་པ་སྒོམ་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་གཉིས་པ་ཞེས་བྱའོ།
en: (2) That which makes them cultivate patience while they are among obstinate sentient beings full of aggression; this is the second amazing and marvelous attitude.

source: །སེམས་ཅན་ལམ་ལོག་པ་ལ་སྤྱོད་པ་དག་མཐོང་ནས་བདག་ཉིད་ཡང་དག་པའི་ལམ་ལ་བརྩོན་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་གསུམ་པ་ཞེས་བྱའོ།
en: (3) That which makes them persevere on the correct path themselves, seeing sentient beings practicing on mistaken paths; this is the third amazing and marvelous attitude.

source: །སེམས་ཅན་འཁོར་བ་ལས་ཡོངས་སུ་བཟླ་བའི་ཕྱིར་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་བཞི་པ་ཞེས་བྱའོ།
en: (4) That which makes them give rise to the mind set on unsurpassed and perfect awakening with the extraordinary resolve to liberate sentient beings from saṃsāra; this is the fourth amazing and marvelous attitude.

source: །གང་པོ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་མཆོག་ཅེས་བྱའོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Pūrṇa, these four amazing and marvelous attitudes are known as the supreme, amazing, and marvelous attitudes of bodhisattvas.” At that moment, the Blessed One uttered these verses:

source: སེམས་ཅན་ལེ་ལོ་ཅན་མཐོང་ན།
en: “When bodhisattvas see lazy beings,

source: །བརྩོན་འགྲུས་སེམས་ནི་སྐྱེད་བྱེད་པས། །བདག་གིས་དེ་ལ་ཆོས་མིན་པའི། །དངོས་པོ་བསྟན་སྙམ་ཡོང་མི་སེམས།
en: It incites them to develop their diligence. The thought never occurs to them Of showing them anything contrary to the Dharma.

source: །ཁོང་ཁྲོ་སྟོན་པར་མི་བྱེད་དེ།
en: “They think, ‘I will not show anger;

source: །ཁོང་ཁྲོ་སངས་རྒྱས་ལམ་མིན་ཞེས།
en: Aggression is not the path of the buddhas.’

source: །རྟག་ཏུ་བྱམས་སེམས་སྒོམ་པས་ན།
en: Because they consistently cultivate love,

source: །བྱང་ཆུབ་དེ་ལས་སྐྱེ་བར་འགྱུར།
en: The awakened state is born from that attitude.

source: །སེམས་ཅན་ལམ་ལོག་མོས་པས་ན། །ལོག་པའི་ལམ་ལ་གནས་པར་བྱེད།
en: “Sentient beings follow mistaken paths Because they are attracted to them.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་ལམ། །བཙལ་ནས་སེམས་ཅན་འགོད་པར་བྱེད།
en: Bodhisattvas pursue the correct path And establish sentient beings on that path.

source: །འཁོར་བའི་ཉེས་དམིགས་མཐོང་བས་ན།
en: “Since they perceive the defects of saṃsāra,

source: །རྩེ་གཅིག་སངས་རྒྱས་ཡེ་ཤེས་ཚོལ།
en: They one-pointedly pursue the wisdom of the buddhas.

source: །བླ་མེད་གཏེར་ནི་ཐོབ་གྱུར་ནས། །སེམས་ཅན་བཟླ་བྱ་སྙམ་དུ་སེམས།
en: They think, ‘I shall obtain the unsurpassed treasure And then liberate sentient beings.’

source: །རྨད་བྱུང་དངོས་པོ་འདི་དག་ལས།
en: “There is nothing greater

source: །ལྷག་པའི་གཞན་ནི་སུ་ཡང་མེད།
en: Than these marvelous attitudes.

source: །དེ་ལྟ་བས་ན་ཐོགས་མེད་ཆོས།
en: You should know that these bodhisattvas

source: །འཐོབ་པར་འགྱུར་བར་རིག་པར་བྱ།
en: Will thereby develop qualities without impediment.

source: །ལུས་ཀྱི་གོས་ནི་ཚིག་པ་དང་། །མགོ་ཐོད་མེ་ནི་འབར་བ་བཞིན། །ལེ་ལོའི་སེམས་ནི་སྐྱེས་གྱུར་ན། །མྱུར་བ་ཉིད་དུ་སེལ་བར་བྱེད།
en: “If laziness should arise in their minds, They swiftly clear it away, As if the clothes on their body were burning Or their hair had caught fire.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་རོ།
en: “Pūrṇa,” continued the Blessed One, “if bodhisattvas possess four qualities, joy will be born in their minds.

source: སེམས་ཅན་རྣམས་ནི་འཁོར་བ་ན་གནས་ཤིང་བརྩོན་འགྲུས་མི་རྩོམ་པར་མཐོང་ལ་བདག་ཉིད་ནི་སངས་རྒྱས་ཀྱི་ལམ་ལ་གནས་ནས་བརྩོན་འགྲུས་རྩོམ་པར་མཐོང་བས་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ནི་རྟག་པར་ལེ་ལོ་ཅན་དུ་གྱུར་བར་མཐོང་ལ་བདག་ཉིད་ནི་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་གནས་ནས་བརྩོན་འགྲུས་རྩོམ་པར་མཐོང་བས་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ནི་ཁོང་ཁྲོ་བ་དང་། འཁོན་དུ་འཛིན་པ་དང་། ཕྲག་དོག་ཅན་དུ་གྱུར་པར་མཐོང་ལ་བདག་ཉིད་ནི་ཁོང་ཁྲོ་བ་དང་། འཁོན་དུ་འཛིན་པ་དང་། ཕྲག་དོག་མེད་ཅིང་རྟག་པར་བྱམས་པའི་སེམས་དང་ལྡན་པར་མཐོང་བས་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མངོན་པར་བསྒྲུབ་པར་བརྩོན་པར་གཞན་སུ་ཡང་བདག་དང་མཚུངས་པ་མེད་པར་མཐོང་བས་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པའོ།
en: (1) When bodhisattvas see that sentient beings remain in saṃsāra and do not cultivate diligence, but see that they themselves remain on the path of the buddhas and do cultivate diligence, joy will be born in their minds. (2) When bodhisattvas see that sentient beings are constantly overwhelmed by laziness, but they see that they themselves diligently follow the teachings of the buddhas, joy will be born in their minds. (3) When bodhisattvas see that sentient beings are aggressive, resentful, and jealous, yet they see that they themselves are free from aggression, resentment, and jealousy and always manifest an attitude of love, joy will be born in their minds. (4) When bodhisattvas see that no one matches their diligence in accomplishing the qualities of the buddhas, joy will be born in their minds.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: At that moment, the Blessed One uttered these verses:

source: སེམས་ཅན་ལེ་ལོ་ཅན་མཐོང་ན། །བདག་ཉིད་བརྩོན་འགྲུས་རྩོམ་བྱེད་པས།
en: “Bodhisattvas develop their diligence When they see lazy beings.

source: །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ།
en: As a consequence,

source: །བདག་ཉིད་དགའ་སེམས་འཐོབ་པར་འགྱུར།
en: Joy will be born in their minds.

source: །སྐྱོ་བའི་སེམས་ནི་རབ་ཏུ་སྐྱེ།
en: Weariness has arisen in their minds.

source: །ཁམས་གསུམ་བཙོན་རར་འཇིགས་པས་ན།
en: Fearing the prison of the three realms,

source: །བརྩོན་པའི་སེམས་ཀྱིས་སྤོང་བར་བྱེད།
en: They reject it with great efforts.

source: །སེམས་ཅན་ཁོང་ཁྲོ་འཁོན་འཛིན་དགའ།
en: “Sentient beings are fond of aggression and resentment,

source: །བདག་ཉིད་བྱམས་སེམས་གནས་པས་ན། །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ། །དགའ་བདེ་སེམས་ནི་སྐྱེ་བར་འགྱུར།
en: But bodhisattvas are loving. Therefore, joy and happiness Will be born in their minds.

source: །སེམས་ཅན་རྣམས་ཀྱིས་གང་བྱས་པ། །དེ་དག་ཐམས་ཅད་མི་བྱ་བར། །དེ་ཕྱིར་བདག་གིས་བླ་མེད་པའི། །སངས་རྒྱས་ལམ་ནི་བཙལ་སྙམ་སེམས།
en: “Because of not engaging in any of the activities Performed by ordinary beings, They think, ‘I shall pursue The path of the unsurpassed buddhas.’

source: །སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པ་ཡི། །ཡང་དག་ཡེ་ཤེས་གང་ཡིན་པ། །བདག་གིས་ཡེ་ཤེས་དེ་བསླབས་ནས།
en: “They think, ‘I shall train In the authentic wisdom Praised by the buddhas

source: །སེམས་ཅན་ཀུན་གྱི་སྐྱབས་བྱ་སེམས།
en: And become a refuge for all beings.’

source: །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ། །རྟག་ཏུ་དགའ་སེམས་སྐྱེ་བས་ན།
en: “Therefore, since joy always arises In the minds of bodhisattvas,

source: །འདུས་བྱས་མི་བདེན་དག་ལས་ནི། །ཡང་དག་ཆོས་ནི་སྐྱེ་བར་འགྱུར།
en: From untrue, conditioned phenomena They develop genuine qualities.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མི་ཁོམ་པ་རྣམས་དང་བྲལ་ཏེ། དལ་བ་ཕུན་སུམ་ཚོགས་པ་ཐོབ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མངོན་པར་བསྒྲུབས་པ་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: “Pūrṇa,” continued the Blessed One, “if bodhisattvas possess four qualities, they will be free from the unfree states, and having obtained the complete freedom to do so they will attain the qualities of a buddha without wasting that opportunity.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་དམན་ཞིང་ཤིན་དུ་མཉེན་པས་ན་སེམས་ཅན་དག་མཐོང་བར་གྱུར་པའི་ཚེ་རྟག་པར་བདེ་བར་འོངས་སམ་ཞེས་མདངས་དང་ལྡན་པས་གསོང་པོར་སྨྲ་ཞིང་ཕན་ཚུན་ཚིག་སྦྱིན་པར་བྱེད་པས་རྟག་པར་འཛུམ་པ་དང་ལྡན་པ་ཡིན།
en: (1) Since the minds of bodhisattvas are humble and gentle, they always express the wish for sentient beings to be happy when they see them, and they always speak sincerely and smile while engaging in conversation with someone.

source: སེམས་རྩེ་གཅིག་ཏུ་ཆོས་གཉེར་ཞིང་རྟག་པར་འདྲི་རྟོག་ལ་རབ་ཏུ་མོས་པས་ན་དགེ་བའི་དོན་ཚོལ་ཞིང་བརྩོན་པ་ལ་ཆོག་ཤེས་པ་མེད་པ་ཡིན།
en: (2) Since bodhisattvas pursue the Dharma one-pointedly and are always strongly dedicated to investigating it, they insatiably pursue virtue and exert themselves toward it.

source: དབེན་པའི་གནས་ལ་མོས་ཤིང་གཅིག་པུ་འདུག་པ་ལ་དགའ་བ་ཡིན།
en: (3) Bodhisattvas are attracted to isolated places and enjoy remaining in solitude.
